# PANDAS CASE STUDY 
## We will check the data from titanic dataset

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
titanic = sns.load_dataset("titanic")
titanic.head(2)

In [ ]:
# SAVING DataFrame into csv file 
titanic.to_csv("titanic.csv")

In [ ]:
# basic statistics
titanic.describe()

In [ ]:
# droping few columns
new_titanic=titanic.drop(['deck','embark_town','alone'],axis=1)

In [ ]:
new_titanic.head(2)

In [ ]:
titanic.mean()

In [ ]:
titanic.groupby(["sex","class"]).mean().head()

In [ ]:
titanic.value_counts("survived")

In [ ]:
# children and women are first
titanic[titanic['age']<18].mean()

In [28]:
titanic[titanic['age']<18].groupby(['sex','class']).mean()

               survived  pclass        age     sibsp     parch        fare  \
sex    class
female First   0.875000     1.0  14.125000  0.500000  0.875000  104.083337
       Second  1.000000     2.0   8.333333  0.583333  1.083333   26.241667
       Third   0.542857     3.0   8.428571  1.571429  1.057143   18.727977
male   First   1.000000     1.0   8.230000  0.500000  2.000000  116.072900
       Second  0.818182     2.0   4.757273  0.727273  1.000000   25.659473
       Third   0.232558     3.0   9.963256  2.069767  1.000000   22.752523

               adult_male     alone
sex    class
female First     0.000000  0.125000
       Second    0.000000  0.166667
       Third     0.000000  0.228571
male   First     0.250000  0.000000
       Second    0.181818  0.181818
       Third     0.348837  0.232558